---
type: AngularDimension
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# AngularDimension

`Autodesk.Revit.DB.AngularDimension` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | 2017 | `public static AngularDimension Create ( Document document , View dbView , Arc arc , IList < Reference > references , DimensionType dimensionStyle )` |
| Method | SetAngularRadius | 2017 | `public void SetAngularRadius ( double radius )` |
| Property | Parameter | — | `` |